LuckiBit/stm32-template/stm32f103ze/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOD pin 6 configuration. */
#define BSP_GPIOD_6_PORT          GPIOD
#define BSP_GPIOD_6_PIN           GPIO_PIN_6
#define BSP_GPIOD_6_INITIALIZE    true
#define BSP_GPIOD_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_6_PULL          GPIO_NOPULL
#define BSP_GPIOD_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_6_IS_OUTPUT     false

/* GPIOD pin 7 configuration. */
#define BSP_GPIOD_7_PORT          GPIOD
#define BSP_GPIOD_7_PIN           GPIO_PIN_7
#define BSP_GPIOD_7_INITIALIZE    true
#define BSP_GPIOD_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_7_PULL          GPIO_NOPULL
#define BSP_GPIOD_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_7_IS_OUTPUT     false

/* GPIOD pin 8 configuration. */
#define BSP_GPIOD_8_PORT          GPIOD
#define BSP_GPIOD_8_PIN           GPIO_PIN_8
#define BSP_GPIOD_8_INITIALIZE    true
#define BSP_GPIOD_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_8_PULL          GPIO_NOPULL
#define BSP_GPIOD_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_8_IS_OUTPUT     false

/* GPIOD pin 9 configuration. */
#define BSP_GPIOD_9_PORT          GPIOD
#define BSP_GPIOD_9_PIN           GPIO_PIN_9
#define BSP_GPIOD_9_INITIALIZE    true
#define BSP_GPIOD_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_9_PULL          GPIO_NOPULL
#define BSP_GPIOD_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_9_IS_OUTPUT     false

/* GPIOD pin 10 configuration. */
#define BSP_GPIOD_10_PORT          GPIOD
#define BSP_GPIOD_10_PIN           GPIO_PIN_10
#define BSP_GPIOD_10_INITIALIZE    true
#define BSP_GPIOD_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_10_PULL          GPIO_NOPULL
#define BSP_GPIOD_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_10_IS_OUTPUT     false

/* GPIOD pin 11 configuration. */
#define BSP_GPIOD_11_PORT          GPIOD
#define BSP_GPIOD_11_PIN           GPIO_PIN_11
#define BSP_GPIOD_11_INITIALIZE    true
#define BSP_GPIOD_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_11_PULL          GPIO_NOPULL
#define BSP_GPIOD_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_11_IS_OUTPUT     false

/* GPIOD pin 12 configuration. */
#define BSP_GPIOD_12_PORT          GPIOD
#define BSP_GPIOD_12_PIN           GPIO_PIN_12
#define BSP_GPIOD_12_INITIALIZE    true
#define BSP_GPIOD_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_12_PULL          GPIO_NOPULL
#define BSP_GPIOD_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_12_IS_OUTPUT     false

/* GPIOD pin 13 configuration. */
#define BSP_GPIOD_13_PORT          GPIOD
#define BSP_GPIOD_13_PIN           GPIO_PIN_13
#define BSP_GPIOD_13_INITIALIZE    true
#define BSP_GPIOD_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_13_PULL          GPIO_NOPULL
#define BSP_GPIOD_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_13_IS_OUTPUT     false

/* GPIOD pin 14 configuration. */
#define BSP_GPIOD_14_PORT          GPIOD
#define BSP_GPIOD_14_PIN           GPIO_PIN_14
#define BSP_GPIOD_14_INITIALIZE    true
#define BSP_GPIOD_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_14_PULL          GPIO_NOPULL
#define BSP_GPIOD_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_14_IS_OUTPUT     false

/* GPIOD pin 15 configuration. */
#define BSP_GPIOD_15_PORT          GPIOD
#define BSP_GPIOD_15_PIN           GPIO_PIN_15
#define BSP_GPIOD_15_INITIALIZE    true
#define BSP_GPIOD_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_15_PULL          GPIO_NOPULL
#define BSP_GPIOD_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_15_IS_OUTPUT     false

/* GPIOE pin 0 configuration. */
#define BSP_GPIOE_0_PORT          GPIOE
#define BSP_GPIOE_0_PIN           GPIO_PIN_0
#define BSP_GPIOE_0_INITIALIZE    true
#define BSP_GPIOE_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_0_PULL          GPIO_NOPULL
#define BSP_GPIOE_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_0_IS_OUTPUT     false

/* GPIOE pin 1 configuration. */
#define BSP_GPIOE_1_PORT          GPIOE
#define BSP_GPIOE_1_PIN           GPIO_PIN_1
#define BSP_GPIOE_1_INITIALIZE    true
#define BSP_GPIOE_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_1_PULL          GPIO_NOPULL
#define BSP_GPIOE_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_1_IS_OUTPUT     false

/* GPIOE pin 2 configuration. */
#define BSP_GPIOE_2_PORT          GPIOE
#define BSP_GPIOE_2_PIN           GPIO_PIN_2
#define BSP_GPIOE_2_INITIALIZE    true
#define BSP_GPIOE_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_2_PULL          GPIO_NOPULL
#define BSP_GPIOE_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_2_IS_OUTPUT     false

/* GPIOE pin 3 configuration. */
#define BSP_GPIOE_3_PORT          GPIOE
#define BSP_GPIOE_3_PIN           GPIO_PIN_3
#define BSP_GPIOE_3_INITIALIZE    true
#define BSP_GPIOE_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_3_PULL          GPIO_NOPULL
#define BSP_GPIOE_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_3_IS_OUTPUT     false

/* GPIOE pin 4 configuration. */
#define BSP_GPIOE_4_PORT          GPIOE
#define BSP_GPIOE_4_PIN           GPIO_PIN_4
#define BSP_GPIOE_4_INITIALIZE    true
#define BSP_GPIOE_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_4_PULL          GPIO_NOPULL
#define BSP_GPIOE_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_4_IS_OUTPUT     false

/* GPIOE pin 5 configuration. */
#define BSP_GPIOE_5_PORT          GPIOE
#define BSP_GPIOE_5_PIN           GPIO_PIN_5
#define BSP_GPIOE_5_INITIALIZE    true
#define BSP_GPIOE_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_5_PULL          GPIO_NOPULL
#define BSP_GPIOE_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_5_IS_OUTPUT     false

/* GPIOE pin 6 configuration. */
#define BSP_GPIOE_6_PORT          GPIOE
#define BSP_GPIOE_6_PIN           GPIO_PIN_6
#define BSP_GPIOE_6_INITIALIZE    true
#define BSP_GPIOE_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_6_PULL          GPIO_NOPULL
#define BSP_GPIOE_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_6_IS_OUTPUT     false

/* GPIOE pin 7 configuration. */
#define BSP_GPIOE_7_PORT          GPIOE
#define BSP_GPIOE_7_PIN           GPIO_PIN_7
#define BSP_GPIOE_7_INITIALIZE    true
#define BSP_GPIOE_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOE_7_PULL          GPIO_NOPULL
#define BSP_GPIOE_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOE_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOE_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOE_7_IS_OUTPUT     false

