LuckiBit/stm32-template/stm32f103ze/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOF pin 14 configuration. */
#define BSP_GPIOF_14_PORT          GPIOF
#define BSP_GPIOF_14_PIN           GPIO_PIN_14
#define BSP_GPIOF_14_INITIALIZE    true
#define BSP_GPIOF_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_14_PULL          GPIO_NOPULL
#define BSP_GPIOF_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_14_IS_OUTPUT     false

/* GPIOF pin 15 configuration. */
#define BSP_GPIOF_15_PORT          GPIOF
#define BSP_GPIOF_15_PIN           GPIO_PIN_15
#define BSP_GPIOF_15_INITIALIZE    true
#define BSP_GPIOF_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOF_15_PULL          GPIO_NOPULL
#define BSP_GPIOF_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOF_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOF_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOF_15_IS_OUTPUT     false

/* GPIOG pin 0 configuration. */
#define BSP_GPIOG_0_PORT          GPIOG
#define BSP_GPIOG_0_PIN           GPIO_PIN_0
#define BSP_GPIOG_0_INITIALIZE    true
#define BSP_GPIOG_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_0_PULL          GPIO_NOPULL
#define BSP_GPIOG_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_0_IS_OUTPUT     false

/* GPIOG pin 1 configuration. */
#define BSP_GPIOG_1_PORT          GPIOG
#define BSP_GPIOG_1_PIN           GPIO_PIN_1
#define BSP_GPIOG_1_INITIALIZE    true
#define BSP_GPIOG_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_1_PULL          GPIO_NOPULL
#define BSP_GPIOG_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_1_IS_OUTPUT     false

/* GPIOG pin 2 configuration. */
#define BSP_GPIOG_2_PORT          GPIOG
#define BSP_GPIOG_2_PIN           GPIO_PIN_2
#define BSP_GPIOG_2_INITIALIZE    true
#define BSP_GPIOG_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_2_PULL          GPIO_NOPULL
#define BSP_GPIOG_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_2_IS_OUTPUT     false

/* GPIOG pin 3 configuration. */
#define BSP_GPIOG_3_PORT          GPIOG
#define BSP_GPIOG_3_PIN           GPIO_PIN_3
#define BSP_GPIOG_3_INITIALIZE    true
#define BSP_GPIOG_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_3_PULL          GPIO_NOPULL
#define BSP_GPIOG_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_3_IS_OUTPUT     false

/* GPIOG pin 4 configuration. */
#define BSP_GPIOG_4_PORT          GPIOG
#define BSP_GPIOG_4_PIN           GPIO_PIN_4
#define BSP_GPIOG_4_INITIALIZE    true
#define BSP_GPIOG_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_4_PULL          GPIO_NOPULL
#define BSP_GPIOG_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_4_IS_OUTPUT     false

/* GPIOG pin 5 configuration. */
#define BSP_GPIOG_5_PORT          GPIOG
#define BSP_GPIOG_5_PIN           GPIO_PIN_5
#define BSP_GPIOG_5_INITIALIZE    true
#define BSP_GPIOG_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_5_PULL          GPIO_NOPULL
#define BSP_GPIOG_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_5_IS_OUTPUT     false

/* GPIOG pin 6 configuration. */
#define BSP_GPIOG_6_PORT          GPIOG
#define BSP_GPIOG_6_PIN           GPIO_PIN_6
#define BSP_GPIOG_6_INITIALIZE    true
#define BSP_GPIOG_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_6_PULL          GPIO_NOPULL
#define BSP_GPIOG_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_6_IS_OUTPUT     false

/* GPIOG pin 7 configuration. */
#define BSP_GPIOG_7_PORT          GPIOG
#define BSP_GPIOG_7_PIN           GPIO_PIN_7
#define BSP_GPIOG_7_INITIALIZE    true
#define BSP_GPIOG_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_7_PULL          GPIO_NOPULL
#define BSP_GPIOG_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_7_IS_OUTPUT     false

/* GPIOG pin 8 configuration. */
#define BSP_GPIOG_8_PORT          GPIOG
#define BSP_GPIOG_8_PIN           GPIO_PIN_8
#define BSP_GPIOG_8_INITIALIZE    true
#define BSP_GPIOG_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_8_PULL          GPIO_NOPULL
#define BSP_GPIOG_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_8_IS_OUTPUT     false

/* GPIOG pin 9 configuration. */
#define BSP_GPIOG_9_PORT          GPIOG
#define BSP_GPIOG_9_PIN           GPIO_PIN_9
#define BSP_GPIOG_9_INITIALIZE    true
#define BSP_GPIOG_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_9_PULL          GPIO_NOPULL
#define BSP_GPIOG_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_9_IS_OUTPUT     false

/* GPIOG pin 10 configuration. */
#define BSP_GPIOG_10_PORT          GPIOG
#define BSP_GPIOG_10_PIN           GPIO_PIN_10
#define BSP_GPIOG_10_INITIALIZE    true
#define BSP_GPIOG_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_10_PULL          GPIO_NOPULL
#define BSP_GPIOG_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_10_IS_OUTPUT     false

/* GPIOG pin 11 configuration. */
#define BSP_GPIOG_11_PORT          GPIOG
#define BSP_GPIOG_11_PIN           GPIO_PIN_11
#define BSP_GPIOG_11_INITIALIZE    true
#define BSP_GPIOG_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_11_PULL          GPIO_NOPULL
#define BSP_GPIOG_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_11_IS_OUTPUT     false

