LuckiBit/stm32-template/stm32f103ze/bootloader/hardware/bsp/gpio/bsp_gpio.c
/* GPIOG pin 12 configuration. */
#define BSP_GPIOG_12_PORT          GPIOG
#define BSP_GPIOG_12_PIN           GPIO_PIN_12
#define BSP_GPIOG_12_INITIALIZE    true
#define BSP_GPIOG_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_12_PULL          GPIO_NOPULL
#define BSP_GPIOG_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_12_IS_OUTPUT     false

/* GPIOG pin 13 configuration. */
#define BSP_GPIOG_13_PORT          GPIOG
#define BSP_GPIOG_13_PIN           GPIO_PIN_13
#define BSP_GPIOG_13_INITIALIZE    true
#define BSP_GPIOG_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_13_PULL          GPIO_NOPULL
#define BSP_GPIOG_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_13_IS_OUTPUT     false

/* GPIOG pin 14 configuration. */
#define BSP_GPIOG_14_PORT          GPIOG
#define BSP_GPIOG_14_PIN           GPIO_PIN_14
#define BSP_GPIOG_14_INITIALIZE    true
#define BSP_GPIOG_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_14_PULL          GPIO_NOPULL
#define BSP_GPIOG_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_14_IS_OUTPUT     false

/* GPIOG pin 15 configuration. */
#define BSP_GPIOG_15_PORT          GPIOG
#define BSP_GPIOG_15_PIN           GPIO_PIN_15
#define BSP_GPIOG_15_INITIALIZE    true
#define BSP_GPIOG_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOG_15_PULL          GPIO_NOPULL
#define BSP_GPIOG_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOG_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOG_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOG_15_IS_OUTPUT     false

#define BSP_GPIO_PIN_CONFIG_LIST(APPLY)                                                            \
    APPLY(BSP_GPIOA_0)                                                                             \
    APPLY(BSP_GPIOA_1)                                                                             \
    APPLY(BSP_GPIOA_2)                                                                             \
    APPLY(BSP_GPIOA_3)                                                                             \
    APPLY(BSP_GPIOA_4)                                                                             \
    APPLY(BSP_GPIOA_5)                                                                             \
    APPLY(BSP_GPIOA_6)                                                                             \
    APPLY(BSP_GPIOA_7)                                                                             \
    APPLY(BSP_GPIOA_8)                                                                             \
    APPLY(BSP_GPIOA_9)                                                                             \
    APPLY(BSP_GPIOA_10)                                                                            \
    APPLY(BSP_GPIOA_11)                                                                            \
    APPLY(BSP_GPIOA_12)                                                                            \
    APPLY(BSP_GPIOA_13)                                                                            \
    APPLY(BSP_GPIOA_14)                                                                            \
    APPLY(BSP_GPIOA_15)                                                                            \
    APPLY(BSP_GPIOB_0)                                                                             \
    APPLY(BSP_GPIOB_1)                                                                             \
    APPLY(BSP_GPIOB_2)                                                                             \
    APPLY(BSP_GPIOB_3)                                                                             \
    APPLY(BSP_GPIOB_4)                                                                             \
    APPLY(BSP_GPIOB_5)                                                                             \
    APPLY(BSP_GPIOB_6)                                                                             \
    APPLY(BSP_GPIOB_7)                                                                             \
    APPLY(BSP_GPIOB_8)                                                                             \
    APPLY(BSP_GPIOB_9)                                                                             \
    APPLY(BSP_GPIOB_10)                                                                            \
    APPLY(BSP_GPIOB_11)                                                                            \
    APPLY(BSP_GPIOB_12)                                                                            \
    APPLY(BSP_GPIOB_13)                                                                            \
    APPLY(BSP_GPIOB_14)                                                                            \
    APPLY(BSP_GPIOB_15)                                                                            \
    APPLY(BSP_GPIOC_0)                                                                             \
    APPLY(BSP_GPIOC_1)                                                                             \
    APPLY(BSP_GPIOC_2)                                                                             \
    APPLY(BSP_GPIOC_3)                                                                             \
    APPLY(BSP_GPIOC_4)                                                                             \
    APPLY(BSP_GPIOC_5)                                                                             \
    APPLY(BSP_GPIOC_6)                                                                             \
    APPLY(BSP_GPIOC_7)                                                                             \
    APPLY(BSP_GPIOC_8)                                                                             \
    APPLY(BSP_GPIOC_9)                                                                             \
    APPLY(BSP_GPIOC_10)                                                                            \
    APPLY(BSP_GPIOC_11)                                                                            \
    APPLY(BSP_GPIOC_12)                                                                            \
    APPLY(BSP_GPIOC_13)                                                                            \
    APPLY(BSP_GPIOC_14)                                                                            \
    APPLY(BSP_GPIOC_15)                                                                            \
    APPLY(BSP_GPIOD_0)                                                                             \
    APPLY(BSP_GPIOD_1)                                                                             \
    APPLY(BSP_GPIOD_2)                                                                             \
    APPLY(BSP_GPIOD_3)                                                                             \
    APPLY(BSP_GPIOD_4)                                                                             \
    APPLY(BSP_GPIOD_5)                                                                             \
    APPLY(BSP_GPIOD_6)                                                                             \
    APPLY(BSP_GPIOD_7)                                                                             \
    APPLY(BSP_GPIOD_8)                                                                             \
    APPLY(BSP_GPIOD_9)                                                                             \
    APPLY(BSP_GPIOD_10)                                                                            \
    APPLY(BSP_GPIOD_11)                                                                            \
    APPLY(BSP_GPIOD_12)                                                                            \
    APPLY(BSP_GPIOD_13)                                                                            \
    APPLY(BSP_GPIOD_14)                                                                            \
    APPLY(BSP_GPIOD_15)                                                                            \
    APPLY(BSP_GPIOE_0)                                                                             \
    APPLY(BSP_GPIOE_1)                                                                             \
    APPLY(BSP_GPIOE_2)                                                                             \
    APPLY(BSP_GPIOE_3)                                                                             \
    APPLY(BSP_GPIOE_4)                                                                             \
    APPLY(BSP_GPIOE_5)                                                                             \
    APPLY(BSP_GPIOE_6)                                                                             \
    APPLY(BSP_GPIOE_7)                                                                             \
    APPLY(BSP_GPIOE_8)                                                                             \
    APPLY(BSP_GPIOE_9)                                                                             \
    APPLY(BSP_GPIOE_10)                                                                            \
    APPLY(BSP_GPIOE_11)                                                                            \
    APPLY(BSP_GPIOE_12)                                                                            \
    APPLY(BSP_GPIOE_13)                                                                            \
    APPLY(BSP_GPIOE_14)                                                                            \
    APPLY(BSP_GPIOE_15)                                                                            \
    APPLY(BSP_GPIOF_0)                                                                             \
    APPLY(BSP_GPIOF_1)                                                                             \
    APPLY(BSP_GPIOF_2)                                                                             \
    APPLY(BSP_GPIOF_3)                                                                             \
    APPLY(BSP_GPIOF_4)                                                                             \
    APPLY(BSP_GPIOF_5)                                                                             \
    APPLY(BSP_GPIOF_6)                                                                             \
    APPLY(BSP_GPIOF_7)                                                                             \
    APPLY(BSP_GPIOF_8)                                                                             \
    APPLY(BSP_GPIOF_9)                                                                             \
    APPLY(BSP_GPIOF_10)                                                                            \
    APPLY(BSP_GPIOF_11)                                                                            \
    APPLY(BSP_GPIOF_12)                                                                            \
    APPLY(BSP_GPIOF_13)                                                                            \
    APPLY(BSP_GPIOF_14)                                                                            \
    APPLY(BSP_GPIOF_15)                                                                            \
    APPLY(BSP_GPIOG_0)                                                                             \
    APPLY(BSP_GPIOG_1)                                                                             \
    APPLY(BSP_GPIOG_2)                                                                             \
    APPLY(BSP_GPIOG_3)                                                                             \
    APPLY(BSP_GPIOG_4)                                                                             \
    APPLY(BSP_GPIOG_5)                                                                             \
    APPLY(BSP_GPIOG_6)                                                                             \
    APPLY(BSP_GPIOG_7)                                                                             \
    APPLY(BSP_GPIOG_8)                                                                             \
    APPLY(BSP_GPIOG_9)                                                                             \
    APPLY(BSP_GPIOG_10)                                                                            \
    APPLY(BSP_GPIOG_11)                                                                            \
    APPLY(BSP_GPIOG_12)                                                                            \
    APPLY(BSP_GPIOG_13)                                                                            \
    APPLY(BSP_GPIOG_14)                                                                            \
    APPLY(BSP_GPIOG_15)

#define BSP_GPIO_LOAD_CASE(pin_name)                                                               \
    case pin_name:                                                                                 \
        config.port          = pin_name##_PORT;                                                    \
        config.pin           = pin_name##_PIN;                                                     \
        config.initialize    = pin_name##_INITIALIZE;                                              \
        config.mode          = pin_name##_MODE;                                                    \
        config.pull          = pin_name##_PULL;                                                    \
        config.speed         = pin_name##_SPEED;                                                   \
        config.initial_state = pin_name##_INITIAL_STATE;                                           \
        config.safe_state    = pin_name##_SAFE_STATE;                                              \
        config.is_output     = pin_name##_IS_OUTPUT;                                               \
        break;

typedef struct
{
    GPIO_TypeDef *port;
    uint16_t      pin;
    uint32_t      mode;
    uint32_t      pull;
    uint32_t      speed;
    GPIO_PinState initial_state;
    GPIO_PinState safe_state;
    bool          initialize;
    bool          is_output;
} bsp_gpio_pin_config_t;

static bool bsp_gpio_pin_is_valid(bsp_gpio_pin_t pin_id)
{
    return (uint32_t)pin_id < (uint32_t)BSP_GPIO_PIN_COUNT;
}

static bool bsp_gpio_level_is_valid(bsp_gpio_level_t level)
{
    return (level == BSP_GPIO_LEVEL_LOW) || (level == BSP_GPIO_LEVEL_HIGH);
}

static bsp_gpio_pin_config_t bsp_gpio_get_config(bsp_gpio_pin_t pin_id)
{
    bsp_gpio_pin_config_t config = {0};

